class MessengerBot

	GREETING_MESSAGE_SALUTATION = {
		"en" => "Hey ",
		"ta" => "வணக்கம் "
	}
	GREETING_MESSAGE_CONTENT = {
		"en" => "Glad to have you on board. I will keep reminding you about the vaccination days for your kids.",
		"ta" => "விக்கிப்பீடியா உங்களை வரவேற்கிறது"
	}

	OLD_USER_GREETING_CONTENT = {
		"en" => "You can edit your previous records, or continue with the same",
		"ta" => "நீங்கள் முந்தைய பதிவுகளை திருத்தலாம், அல்லது அதே பதிவுடன் தொடரலாம்"
	}
	HI_MESSAGE_CONTENT = {
		"en" => " Glad to see you!",
		"ta" => "உங்களைப் பார்ப்பது மகிழ்ச்சி!"
	}
	UPCOMING_VACCINATION_DETAILS_BUTTON = {
		"en" => "Upcoming Vaccination Details",
		"ta" => "எதிர்வரும் தடுப்பூசி நாட்கள்"
	}

	PREVIOUS_VACCINATION_DETAILS_BUTTON = {
		"en" => "Previous Vaccination Details",
		"ta" => "முந்தைய தடுப்பூசி நாட்கள்"
	}

	SUBSCRIPTION_BUTTON = {
		"en" => "Subscription",
		"ta" => "சந்தா"
	}

	PROFILE_BUTTON = {
		"en" => "Profile",
		"ta" => "சுயவிவரம்"
	}

	MORE_BUTTON = {
		"en" => "More",
		"ta" => "மேலும்"
	}

	HELP_TEXT = {
		"en" => "Try these simple commands,\n*Show my upcoming vaccines\n*what are my past vaccines?\n*change my kid name\n*show my profile",
		"ta" => "இந்த எளிய கட்டளைகளை முயற்சிக்கவும் \n * என் வரவிருக்கும் தடுப்பூசிகளை காட்டுக \n * எனது கடந்த தடுப்பூசிகள் என்ன? \n * என் குழந்தையின் பெயரை மாற்றவும் \n * என் சுயவிவரத்தைக் காட்டு"
	}


	UPCOMING_VACCINATION_MESSAGE_TEXT = {
		"en" => "upcoming vaccines",
		"ta" => "எதிர்வரும் தடுப்பூசி"
	}
	PREVIOUS_VACCINATION_MESSAGE_TEXT = {
		"en" => "previous vaccines",
		"ta" => "முந்தைய தடுப்பூசிகள்"
	}
	PROFILE_MESSAGE_TEXT = {
		"en" => "profile",
		"ta" => "சுயவிவரம்"
	}
	EDIT_KID_NAME_TEXT = {
		"en" => "edit kid name",
		"ta" => "குழந்தை பெயரை திருத்தவும்"
	}
	EDIT_KID_DOB_TEXT = {
		"en" => "edit kid dob",
		"ta" => "குழந்தையின் பிறந்த தேதி திருத்தவும்"
	}
	EDIT_KID_GENDER_TEXT = {
		"en" => "edit kid gender",
		"ta" => "குழந்தை பாலினத்தை திருத்தவும்"
	}

	QUICK_REPLY_HEADER = {
		"en" => "How can I help you?",
		"ta" => "நான் உங்களுக்கு ஏவ்வாறு உதவ வேண்டும் "
	}

	QUICK_REPLIES_OPTIONS = {
		"Upcoming Vaccines" => {
			"en" => "Upcoming Vaccines",
			"ta" => "எதிர்வரும் தடுப்பூசிகள்"
		},
		"Previous Vaccines" => {
			"en" => "Previous Vaccines",
			"ta" => "முந்தைய தடுப்பூசிகள்"
		}
	}

	KID_GENDER_UPDATED_TEXT = {
		"en" => "Done, We have edited your Kid Gender!",
		"ta" => "முடிந்தது, நாங்கள் உங்கள் குழந்தை பாலினத்தை திருத்திவிட்டோம்!"
	}
	KID_DOB_UPDATED_TEXT = {
		"en" => "Done, We have updated your Kid Date Of Birth!",
		"ta" => "முடிந்தது, நாங்கள் உங்கள் பிறந்தநாள் பிறந்த நாளை திருத்திவிட்டோம்!"
	}
	KID_NAME_UPDATED_TEXT = {
		"en" => "Done, We have updated your Kid Name as ",
		"ta" => "முடிந்தது, உங்கள் குழந்தை பெயரை ஆக நாங்கள் திருத்திவிட்டோம்!"
	}
	ASK_DOB_TEXT = {
		"en" => "What is your kid's DOB?",
		"ta" => "உங்கள் குழந்தையின் பிறந்தநாள் என்ன?"
	}
	ASK_KID_NAME = {
		"en" => "Tell me your your kid name",
		"ta" => "உங்கள் குழந்தையின் பெயரை சொல்லவும்"
	}
	GOT_IT_TEXT = {
		"en" => "Got it, ",
		"ta" => "புரிந்தது"
	}
	INVALID_DOB_ERROR_TEXT = {
		"en" => "Invalid Date , provide it in DD-MM-YYYY format",
		"ta" => "தவறான தேதி, DD-MM-YYYY வடிவத்தில் வழங்கவும்"
	}
	INVALID_GENDER_ERROR_TEXT = {
		"en" => "Please provide a valid gender!",
		"ta" => "சரியான பாலினத்தை வழங்கவும்!"
	}
	REGISTERATION_SUCCESSFULL_TEXT = {
		"en" => "Thanks for registering your kid details. We will notify you before the vaccination days.",
		"ta" => "உங்கள் குழந்தை விவரங்களை பதிவு செய்வதற்கு நன்றி. தடுப்பூசி நாட்களுக்கு முன்னர் நாங்கள் உங்களுக்கு அறிவிப்போம்."
	}


	YOUR_NAME = {
		"en" => "Your Name",
		"ta" => "உங்கள் பெயர்"
	}
	YOUR_KID_NAME = {
		"en" => "Kid Name",
		"ta" => "குழந்தை பெயர்"
	}
	KID_DOB = {
		"en" => "Date Of Birth",
		"ta" => "பிறந்த நாள்"
	}
	KID_GENDER = {
		"en" => "Kid Gender",
		"ta" => "குழந்தை பாலினம்"
	}

	WHY_SUBSCRIBE_TEXT = {
		"en" => "I will remind you about the vaccination days for your kid on the appropriate dates.",
		"ta" => "உங்களின் குழந்தைக்கு பொருத்தமான தேதிகளில் தடுப்பூசி நாட்கள் பற்றி நான் நினைவூட்டுவேன்."
	}
	

	COULDNOT_UNDERSTAND_THE_MESSAGE_TEXT = {
		"en" => "Sorry I couldn't understand that.. 🙁",
		"ta" => "மன்னிக்கவும் எனக்கு புரியவில்லை .. 🙁"
	}


end